Revit 2026 API

# IFCAnyHandleSetAttribute(String, Double) Method

---

Sets the attribute value.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAttribute(
	string name,
	double value
)
```
```vb
Public Sub SetAttribute (
	name As String,
	value As Double
)
```
```cpp
public:
void SetAttribute(
	String^ name,
	double value
)
```
```fsharp
member SetAttribute :
        name : string *
        value : float -> unit
```

#### Parameters

name String
     The attribute name.
value Double
     The value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace